org/posts/recover-windows-boot.org
#+title: Recover windows boot
#+description: How to recover the windows boot partition files.
#+date: 2025-01-18
#+export_file_name: recover-windows-boot
#+hugo_base_dir: ~/webdev/jpachecoxyz/
#+hugo_section: posts
#+hugo_tags: blog windows
#+hugo_custom_front_matter: toc true
#+hugo_auto_set_lastmod: nil
#+hugo_draft: false

This guide is suggested when you accidentally format the boot partition while installing a new OS, wiping out the Windows bootloader in the process. This has happened to me on more than one occasion, which is why I decided to document it.

It has also happened when the Windows bootloader is deleted. The following steps are solely for copying the Windows boot files using the ISO onto the partition without having to reformat it.

* Select the disk.
#+begin_src cmd 
list disk sel disk # 
#+end_src

* Select the boot partition.
List the partitions, select the FAT32 partition, and assign a letter to it. 
#+begin_src cmd 
list vol sel vol # assign letter z: 
#+end_src

* Load Windows boot files. 
#+begin_src cmd 
bcdboot c:\windows /s z: /f all 
#+end_src

That's it! Simply restart, boot into the main OS, run =os-prober=, and execute =update-grub= to add the boot entry to =grub=.

